# Curated Homebrew baseline for this machine.
#
# Keep this file intentional. Use `brew bundle dump` to discover candidates,
# then edit the results down to the tools that should exist on every
# rebuild.

# Core CLI tools
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "gh"
brew "htop"
brew "jq"
brew "procs"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "watch"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zoxide"

# AI tooling
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex-app"
cask "codex"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-meslo-lg"
cask "font-meslo-lg-nerd-font"

# Terminal applications
cask "cmux"
cask "ghostty"

# Editors
cask "visual-studio-code"

# Browsers
cask "google-chrome"

# Communication
cask "slack"

# Productivity
cask "1password"
